In [35]:
import pymysql
conn = pymysql.connect(host='localhost', port=3306, user='root', password='Sf@323895474', db='sys')

In [36]:
cursor = conn.cursor()

In [37]:
cursor.execute('CREATE DATABASE IF NOT EXISTS testdb;')

1

In [38]:
cursor.execute('USE testdb;')

0

In [39]:
person_table = '''CREATE TABLE IF NOT EXISTS person
(person_id MEDIUMINT UNSIGNED, first_name VARCHAR(50), last_name VARCHAR(50), 
age TINYINT UNSIGNED, marital_status TINYINT(1), country VARCHAR(75), PRIMARY KEY(person_id));'''

In [40]:
cursor.execute(person_table)

0

In [41]:
cursor.execute('DESC person;')

6

In [42]:
cursor.fetchall()

(('person_id', 'mediumint unsigned', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'YES', '', None, ''),
 ('last_name', 'varchar(50)', 'YES', '', None, ''),
 ('age', 'tinyint unsigned', 'YES', '', None, ''),
 ('marital_status', 'tinyint(1)', 'YES', '', None, ''),
 ('country', 'varchar(75)', 'YES', '', None, ''))

In [43]:
cursor.execute('USE school;')

0

In [44]:
students_table = '''CREATE TABLE IF NOT EXISTS students
(student_id MEDIUMINT UNSIGNED, first_name VARCHAR(50), last_name VARCHAR(50), 
address VARCHAR(150), state CHAR(2), date_of_birth DATE, 
phone_number BIGINT, gender ENUM('Male', 'Female'), PRIMARY KEY(student_id));'''
cursor.execute(students_table)

0

In [45]:
cursor.execute('DESC students;')
cursor.fetchall()

(('student_id', 'mediumint unsigned', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'YES', '', None, ''),
 ('last_name', 'varchar(50)', 'YES', '', None, ''),
 ('address', 'varchar(150)', 'YES', '', None, ''),
 ('state', 'char(2)', 'YES', '', None, ''),
 ('date_of_birth', 'date', 'YES', '', None, ''),
 ('phone_number', 'bigint', 'YES', '', None, ''),
 ('gender', "enum('male','female')", 'YES', '', None, ''))

In [46]:
cursor.execute('USE testdb')
cursor.execute('DROP TABLE person')

0

In [47]:
cursor = conn.cursor()

In [48]:
cursor.execute('USE school;')

0

In [51]:
four_rows = '''INSERT INTO students VALUES (1, 'Chana', 'Lewy', 'Yam Suf 16', 'IL', '2020-10-21', 0583298764, 'Female'),
(2, 'Sara', 'Cohen', 'Sorotzkin 51', 'IL', '2020-02-04', 0583292264, 'Female'),
(3, 'Meir', 'Baum', 'Hatavor 3', 'IL', '2021-04-14', 0527198764, 'Male'),
(4, 'Chaim', 'Green', 'Kakal 6', 'IL', '2020-12-11', 0545498764, 'Male');'''

In [52]:
cursor.execute(four_rows)

4

In [53]:
update_third_student = "UPDATE students SET address = 'Haerez 4', state = 'FR' WHERE student_id = 3"

In [54]:
cursor.execute(update_third_student)

1

In [56]:
cursor.execute('DELETE FROM students WHERE gender = "Male"')

2

In [57]:
# DROP / ADD
cursor.execute("ALTER TABLE students ADD email_address CHAR(30)")

0

In [59]:
cursor.execute("ALTER TABLE students MODIFY email_address VARCHAR(30)")

2

In [62]:
cursor.execute("ALTER TABLE students MODIFY email_address VARCHAR(30) FIRST")

0

In [61]:
cursor.execute("ALTER TABLE students MODIFY date_of_birth DATE AFTER last_name")

0

In [66]:
conn.close()